  {-
    4. (По [Анисимов,Пупышев,2006,с.67-68,№7.57])
    Напишите программу, запрашивающую число (не более
    100 знаков) и печатающую слово "Плавное", если число
    плавное, и "Нет" в противном случае.

    Указание. Плавным числом назовём десятичное натуральное
    число, у которого любые две соседние цифры отличаются
    не более чем на единицу. Однозначное число является плавным.
  -}
  import Char

  plav :: Integral a => a -> Bool
  plav n = iterate (show n)
    where
      iterate :: String -> Bool
      iterate []     = True
      iterate (a:[]) = True
      iterate (a:b:r) | abs (x - y) > 1 = False
                      | otherwise       = iterate (b:r)
                      where x = digitToInt a; y = digitToInt b

  -- Неудачные тестовые примеры:

  test1 = all plav [0..9]
