  {-
    2*. Напишите программу для вычисления значения приведенной
    ниже функции (x, y, z <- N) и вычислите с ее помощью
    F(5, 0, 0), F(1000, 0, 0).

    F(x, y, z) = если x = 0
                   то 0
                   иначе если y + 1 = x
                           то z
                           иначе F(x, y + 1, z + 1)
  
    Вычислите значение F(5, 0, 0) с помощью "ручных" вычислений.
  
    Указание (по {Хендерсон, 1983, с.6]). Известный американский
    математик А. Чёрч (автор тезиса Чёрча), создал на подступах к теории
    алгоритмов лямбда-исчисление, являющееся теоретческой моделью
    функционального программирования. Он безуспешно пытался
    выразить в языке лямбда-исчисления операцию вычитания единицы из
    натурального числа (знак операции "Sub").

    ...
  -}



                         