  {-
    3*. Напишите функцию, осуществляющую перестановку
    местами соседних элементов списка. Например:

    [1,2,3,4,5,6] -> [2,1,4,3,6,5],
    [1,2,3]       -> [2,1,3].
  -}

  swap :: [a] -> [a]
  swap lst = iterate [] lst
    where
      iterate :: [a] -> [a] -> [a]
      iterate acc []       = acc
      iterate acc (x:[])   = acc ++ [x]
      iterate acc (x:y:xs) = iterate (acc ++ [y, x]) xs

  -- Неудачные тестовые примеры:

  test =  swap "" == "" &&
          swap "1" == "1" &&
          swap "12" == "21" &&
          swap "123" == "213" &&
          swap "1234" == "2143" &&
          swap "12345" == "21435" &&
          swap "123456" == "214365"
