  -- Задание 2.13
  -- Напишите функцию для вычисления дня Пасхи по формуле Гаусса.
  -- 
  -- В n-й год от Рождества Христова западные церкви празднуют Пасху
  --
  -- (22+d+e) марта или (d+e-9) апреля,
  --
  -- где d=(19a+M) mod 30, e=(2b+4c+6d+N) mod 7,
  -- a=n mod 19, b=n mod 4, c=n mod 7;
  -- M=23, N=3 при n=17**; M=24, N=5 при n=20**;
  -- M=23, N=4 при n=18**; M=24, N=6 при n=21**.
  -- M=24, N=5 при n=19**;

  -- дата католической пасхи
  -- пригодно для 1599 <= y (верхняя граница не оценена)
  getEasterDate :: Int -> (Int, Int)
  getEasterDate y | d == 29 && e == 6             = (19, 04)
                  | d == 28 && e == 6
                    && (11*m + 11) `mod` 30 < 19  = (18, 04)
                  | otherwise =
                      if (mar < 1 || mar > 31)
                        then (apr, 04)
                        else (mar, 03)
                  where
                    a = y `mod` 19
                    b = y `mod` 4
                    c = y `mod` 7
                    k = y `div` 100
                    p = (13 + 8 * k) `div` 25
                    q = k `div` 4
                    m = case y `div` 100 of
                      17 -> 23
                      18 -> 23
                      19 -> 24
                      20 -> 24
                      21 -> 24
                      _  -> (15 - p + k - q) `mod` 30
                    n = case y `div` 100 of
                      17 -> 3
                      18 -> 4
                      19 -> 5
                      20 -> 5
                      21 -> 6
                      _  -> (4 + k - q) `mod` 7
                    d = (19 * a + m) `mod` 30
                    e = (2 * b + 4 * c + 6 * d + n) `mod` 7
                    mar = 22 + d + e
                    apr = d + e - 9

  check :: (Int, Int, Int) -> Bool
  check (y, d, m) = getEasterDate y == (d, m)

  test = all check [
            (1599, 11, 4)
          , (1600, 2, 4)
          , (1699, 19, 4)
          , (1700, 11, 4)
          , (1777, 30, 3)
          , (1799, 24, 3)
          , (1800, 13, 4)
          , (1899, 2, 4)
          , (1900, 15, 4)
          , (1999, 4, 4)
          , (2000, 23, 4)
          , (2099, 12, 4)
          , (2100, 28, 3)
          , (2199, 14, 4)
          , (2200, 6, 4)
          , (2299, 16, 4)
          , (2300, 8, 4)
          , (2399, 28, 3)
          , (2400, 16, 4)
          , (2499, 29, 3)
          , (2500, 18, 4)
          , (2599, 7, 4)
          , (2600, 23, 3)
          , (2699, 9, 4)
          , (2700, 1, 4)
          , (2799, 18, 4)
          , (2800, 2, 4)
          , (2899, 19, 4)
          , (2900, 11, 4)
          , (2999, 24, 3)
          , (3000, 13, 4)
          , (3099, 2, 4)
        ]
