  -- Задание 2.9
  -- Напишите функцию, выводящую по номеру месяца его название.

  getMonthName :: Int -> String
  getMonthName n = case n of
    1  -> "январь"
    2  -> "февраль"
    3  -> "март"
    4  -> "апрель"
    5  -> "май"
    6  -> "июнь"
    7  -> "июль"
    8  -> "август"
    9  -> "сентябрь"
    10 -> "октябрь"
    11 -> "ноябрь"
    12 -> "декабрь"
    _  -> "месяц не определен"

  check :: (Int, String) -> Bool
  check (n, t) = getMonthName n == t

  test = all check [
            (1, "январь")
          , (2, "февраль")
          , (3, "март")
          , (4, "апрель")
          , (5, "май")
          , (6, "июнь")
          , (7, "июль")
          , (8, "август")
          , (9, "сентябрь")
          , (10, "октябрь")
          , (11, "ноябрь")
          , (12, "декабрь")
          , (0, "месяц не определен")
          , (13, "месяц не определен")
        ]
