  {-
    5. Переведите следующие точечные записи списка в списочные:
    
    (1) (1:(2:(3:(4:(5:[])))));
    (2) ((1:[]):((2:[]):((3:[]):[])));
    (3) (((2:(1:[])):[]):[]);
    (4) ((5:(1:[])):((2:(3:[])):[]));
    (5) (((1:[]):((2:[]):[])):(((3:[]):[]):[])).
  -}

  -- (1)
  lst1a = (1:(2:(3:(4:(5:[])))))
  lst1b = [1, 2, 3, 4, 5]

  -- (2)
  lst2a = ((1:[]):((2:[]):((3:[]):[])))
  lst2b = [[1], [2], [3]]

  -- (3)
  lst3a = (((2:(1:[])):[]):[])
  lst3b = [[[2, 1]]]

  -- (4)
  lst4a = ((5:(1:[])):((2:(3:[])):[]))
  lst4b = [[5, 1], [2, 3]]

  -- (5)
  lst5a = (((1:[]):((2:[]):[])):(((3:[]):[]):[]))
  lst5b = [[[1], [2]], [[3]]]

  -- Неудачные тестовые примеры:

  test1 = lst1a == lst1b
  test2 = lst2a == lst2b
  test3 = lst3a == lst3b
  test4 = lst4a == lst4b
  test5 = lst5a == lst5b

  test = test1 && test2 && test3 && test4 && test5
