  {-
    | 3*. Напишите  функцию,  определяющую  абсолютную и относительную
    | погрешность приближённого равенства
    |
    | 1.49^2.87 ~ п
  -}

  -- Ф-я, вычисляющая погрешность приближенного равенства (с. 5)
  fault :: (Double, Double)
  fault = (
            diff,     -- абсолютная погрешность
            diff / pi -- относительная погрешность
          )
    where
      expr = 1.49 ** 2.87
      diff = abs (expr - pi)

  -- Неудачные тестовые примеры:

  test1 = fst fault <= 8 * (10 ^^ (-4))
  test2 = snd fault <= 3 * (10 ^^ (-4))

  test = test1 && test2
