  {- 
    7*. Напишите функцию для вычисления значения выражения

    sqrt (1 + 2005 * sqrt (1 + 2004 * sqrt (1 + 2003 * 2001)))
  -}

  -- Вспомогательная функция для вычисления выражения вида
  -- sqrt (1 + (2003 + (n - 1)) * sqrt (1 + (2003 + (n - 2) * ... * sqrt (1 + 2003 * 2001))))
  -- где n - целое число, n >= 0
  f :: Floating a => a -> a
  f 0 = 0.0
  f n = iterate (n - 1) (fromIntegral (1 + 2003 * 2001))
    where
      iterate 0 acc = sqrt acc
      iterate i acc = iterate (i - 1) (1 + (2003 + (n - i)) * sqrt acc)

  -- Функция, представляющая значение выражения на с. 4
  g = f 3

  -- Неудачные тестовые примеры:

  test1 = f 0 == 0
  test2 = all (\n -> f n == n + 2001.0) [1..1000]

  test3 = g == 2004.0

  test = test1 && test2 && test3
