  {-
    1*. Укажите прагматику (назначение) рекурсивных функций:
  -}

  -- (1)
  mult n 0 = 0
  mult n m = mult n (m-1)+n

  {-
    Сложить данное число n m раз.
  -}

  -- (2)
  russ n 1 = n
  russ n m | m `mod` 2==0 = russ (n*n) (m `div` 2)
           | True         = n*russ (n*n) (m `div` 2)

  {-
    Возведение данного числа n в натуральную степень m,
    m >= 1
  -}
  
  -- (3)
  z :: Int -> Int -> Int
  z p n | n<p  = 0
        | True = 1 + z p (n `div` p)

  {-
    Вычислить наибольшую степень x натурального числа p,
    при которой удовлетворено неравенство
    p^x <= n
  -}

  -- (4)*
  f :: Int -> String
  f n | n>=1000 = "M" ++ f (n-1000)
      | n>=500  = "D" ++ f (n-500)
      | n>=100  = "C" ++ f (n-100)
      | n>=50   = "L" ++ f (n-50)
      | n>=10   = "X" ++ f (n-10)
      | n>=5    = "V" ++ f (n-5)
      | n>=1    = "I" ++ f (n-1)
      | True    = ""

  {-
    Перевод числа из десятичной системы счисления
    в непозиционную римскую систему счисления
  -}

  -- Неудачные тестовые примеры:
  
  testF = f 12=="XII" && f 1256=="MCCLVI"
