  {-
    9*. [Ахо,Ульман,1978,с.345]
    Напишите программу на  языке  Haskell  для  вычисления  значения
    функции, заданной рекуррентными соотношениями:

    D(0)=1, D(n)=(D(n-1)^2)+1.

    Указание. Для тестирования воспользуйтесь тем, что
    D(n)=]k^2^n[, k=1.502837,

    где ]x[ - наименьшее целое число, большее или равное x.
  -}

  d :: Integral a => a -> a
  d 0 = 1
  d n = (d (n - 1))^2 + 1

  -- Неудачные тестовые примеры:

  eq :: (Ord a, Fractional a) => a -> a -> Bool
  eq a b = abs (a - b) <= 10 ^^ (-6)

  testD n = k ^ 2 ^ n
    where k = 1.502837
