  {-
    10*. По закону Российской федерации производители обязаны марки-
    ровать  продукцию  с  генетически модифицированными ингредиентами с
    помощью номера (PLU-кода) на наклейке производителя; при этом:
  
    (1) если номер состоит из пяти цифр, начинающихся с 9, то
          продукт был выращен без  применения химикатов,
          пестицидов  или  генной модификации;
    (2) четырёхзначное число, начинающееся с 3 или 4, означает,
          что продукт выращен на обычной ферме, которая использует
          химические вещества и пестициды
          и не является генно-модифицированным;
    (3) продукты, отмеченные пятизначным кодом, начинающимся с 8, -
          это генетически модифицированные культуры.
  
    По заданному PLU-коду установите свойства продукта.
  -}
  import Char

  -- На основании данного PLU-кода plu определяет
  -- категорию продукта (п. 1-3).
  -- Возвращает порядковый номер категории или ошибку, если анализ
  -- был провален.
  analyse :: (Num a, Num b) => a -> b
  analyse plu | l == 5 && h == 9             = 1
              | l == 4 && (h == 3 || h == 4) = 2
              | l == 5 && h == 8             = 3
              | otherwise                    = error "PLU-код не распознан"
              where p = show plu; l = length p; h = digitToInt (head p)

  -- Неудачные тестовые примеры:

  test =  analyse 94325 == 1 &&
          analyse 4214  == 2 &&
          analyse 81181 == 3 &&
          analyse 90000 == 1
