  {-
    7. Переведите следующие списочные записи списка в точечные:

    (1) [];
    (2) [[]];
    (3) [[1],[2],[3],[4]];
    (4) [[1,2],[3,4]];
    (5) [[1],[2,22],[3,33,333]];
    (6) [[[9,8,7,6]],[[5,4,3]],[[2,1]],[[0]]].
  -}

  -- (1)
  lst1a = []
  lst1b = []

  -- (2)
  lst2a = [[]]
  lst2b = []:[]

  -- (3)
  lst3a = [[1],[2],[3],[4]]
  lst3b = (1:[]):(2:[]):(3:[]):(4:[]):[]

  -- (4)
  lst4a = [[1,2],[3,4]]
  lst4b = (1:2:[]):(3:4:[]):[]

  -- (5)
  lst5a = [[1],[2,22],[3,33,333]]
  lst5b = (1:[]):(2:22:[]):(3:33:333:[]):[]

  -- (6)
  lst6a = [[[9,8,7,6]],[[5,4,3]],[[2,1]],[[0]]]
  lst6b = ((9:8:7:6:[]):[]) : ((5:4:3:[]):[]) : ((2:1:[]):[]) : ((0:[]):[]) : []

  -- Неудачные тестовые примеры:

  test1 = null lst1a == True && null lst1b == True

  test2 = length lst2a == 1 && length lst2b == 1 &&
          (null $ head lst2a) == (null $ head lst2b)

  test3 = lst3a == lst3b
  test4 = lst4a == lst4b
  test5 = lst5a == lst5b
  test6 = lst6a == lst6b

  test = test1 && test2 && test3 && test4 && test5 && test6
