  -- 2*. Определите прагматику следующей функции:
  import Ratio

  yyy x y | y==0 = error "Знаменатель дроби равен 0"
          | True = (x `quot` d) % (y `quot` d)
      where d = gcd x y

  {-
    Нахождение отношения двух чисел (рациональное число),
    записанного с помощью несократимой дроби (в числителе
    и знаменателе простые числа).

    > yyy 0 5
    0 % 1

    > yyy 0 (-5)
    0 % 1

    > yyy 7 35
    1 % 5

    > yyy (-7) 35
    (-1) % 5

    > yyy 7 (-35)
    (-1) % 5

    > yyy (-7) (-35)
    1 % 5

    > yyy 35 7
    5 % 1
  -}
