  {-
    Пусть f(a) - сумма цифр целого числа a.
    Для заданного x вычислите:

    f(f(x+2)+f(2x))*f(x^2)

    Например, если x=12, то результатом является 18.
  -}

  -- Вычисляет сумму цифр целого числа a, учитывая его знак.
  f :: Integral a => a -> a
  f a = iterate a 0
    where
      iterate 0 sum = sum
      iterate r sum = iterate (r `quot` 10) (sum + r `rem` 10)

  -- Для заданного целого числа x вычисляет значение выражения
  -- f(f(x+2)+f(2x))*f(x^2)
  g :: Integral a => a -> a
  g x = f(f(x + 2) + f(2 * x)) * f (x ^ 2)

  -- Неудачные тестовые примеры:

  fTest = f 0         == 0  &&
          f 1         == 1  &&
          f 123       == 6  &&
          f 100000001 == 2  &&
          f 999       == 27 &&
          f (-0)      == 0  &&
          f (-999)    == -27

  gTest = g 12 == 18

  test = fTest && gTest
