  {-
    9. Напишите функцию, которая по двум спискам,
      имеющим одинаковую длину, возвращает:
    
    (1) первый список, если сумма элементов первого списка 
        совпадает с суммой элементов второго списка;
    (2) сумму элементов второго списка в противном случае.
  -}

  -- Определяет, равны ли значения аргументов, с точностью 10^-6
  eq :: (Ord a, Fractional a) => a -> a -> Bool
  eq a b = abs (a - b) <= 10 ^^ (-6)

  -- Искомая ф-я, принимающая списки l1 и l2 одинаковой длины.
  -- Возвращает Either [a] a: первый список или сумму эл-тов
  -- второго в зависимости от выполнения условия на с. 4 и п. (1).
  f :: (Ord a, Fractional a) => [a] -> [a] -> Either [a] a
  f l1 l2 | length l1 /= length l2 = error "f l1 l2 - Длины списков не равны!"
          | eq (sum l1) (sum l2)   = Left l1
          | otherwise              = Right (sum l2)

  -- Неудачные тестовые примеры:

  test1 = f [] []                                        == Left []
  test2 = f [1] [1]                                      == Left [1]
  test3 = f [1, 4, -1, 0] [1, 0, 2, 1]                   == Left [1, 4, -1, 0]
  test4 = f [1.001, 0.0, 0.0] [1.0001, 0.00085, 0.00005] == Left [1.001, 0.0, 0.0]
  test5 = f [0] [-1]                                     == Right (-1)
  test6 = f [0.0, 0.00001, 0.01] [0.9, 0.05, 0.100005]   == Right 1.050005

  test = test1 && test2 && test3 && test4 && test5 && test6
